# FabricationTopElevationIncludeInsulationOfPart Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..FabricationTopElevationIncludeInsulationOfPart Property
ParameterTypeId Class See Also
---
"Top Elevation with Insulation"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId FabricationTopElevationIncludeInsulationOfPart { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FabricationTopElevationIncludeInsulationOfPart As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ FabricationTopElevationIncludeInsulationOfPart {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace